#for ციკლის საშვალებით გამოთვალეთ რიცხვების ჯამი 20-იდან 40-მდე
Sum = 0
for i in range(20,41):
    Sum+=i
    print(Sum)


#for ციკლის საშვალებით გამოთვალეთ 10-იდან 50-ის ჩათვლით ყველა რიცხვის ჯამი
sum=0
for i in range(10,51):
    sum+=i
    print(sum)

#for ციკლის საშვალებით გამოთვალეთ 20-იდან 100-მდე ყველა ლუწი რიცხვის ჯამი, საბოლოოდ დაბეჭდეთ შედეგი
sum=0
for i in range(20,100,2):
    sum+=i
    print(sum)

#for ციკლის საშვალებით გამოთვალეთ 7-ის ფაქტორიალი. რიცხვის ფაქტორიალი არის ყველა რიცხვის ნამრავლი ამ რიცხვიდან 1-მდე


#while ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე
i = 0
while i <= 20:
    print(i)
    i += 1



# while ციკლის საშვალებით დაბეჭდეთ რიცხვები 10-იდან 30-ის ჩათვლით
i = 10
while i <=31:
    print(i)
    i += 1


#while ციკლის საშვალებით დაბეჭდეთ რიცხვები 15-იდან 80-მდე
i = 15
while i <= 80:
    print(i)
    i += 1




# while ციკლის საშვალებით გამოიტანეთ რიცხვები 50-იდან 0-ჩათვლით
i = 50
while i <= 0:
    print(i)
    i -= 1


#while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ის ჩათვლით
i = 0
while i <= 51:
    print(i)
    i += 3


#while ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 0-იდან 50-ის ჩათვლით
i = 0
while i <= 51:
    print(i)
    i += 2


#while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 100-იდან 20-ის ჩათვლით
i = 100
while i <= 20:
    print(i)
    i -= 3


#შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება პაროლს სანამ ის არ შემოიყვანს goabest123-ს
passord = "goabest123"
Selected_Password = ""

while password != Selected_Password:
    password = input("Enter password: ")

print("Correct")
